pyocd/pyOCD/pyocd/debug/svd/data/HC32K116.svd
                <register>
                    <name>PODRB</name>
                    <description>desc PODRB</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3CFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT0</name>
                            <description>desc POUT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT1</name>
                            <description>desc POUT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT2</name>
                            <description>desc POUT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT3</name>
                            <description>desc POUT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT4</name>
                            <description>desc POUT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT5</name>
                            <description>desc POUT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT6</name>
                            <description>desc POUT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT7</name>
                            <description>desc POUT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT8</name>
                            <description>desc POUT8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT9</name>
                            <description>desc POUT9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT10</name>
                            <description>desc POUT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT11</name>
                            <description>desc POUT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT12</name>
                            <description>desc POUT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT13</name>
                            <description>desc POUT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT14</name>
                            <description>desc POUT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT15</name>
                            <description>desc POUT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT16</name>
                            <description>desc POUT16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT17</name>
                            <description>desc POUT17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PODRC</name>
                    <description>desc PODRC</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3CFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT0</name>
                            <description>desc POUT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT1</name>
                            <description>desc POUT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT2</name>
                            <description>desc POUT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT3</name>
                            <description>desc POUT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT4</name>
                            <description>desc POUT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT5</name>
                            <description>desc POUT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT6</name>
                            <description>desc POUT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT7</name>
                            <description>desc POUT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT8</name>
                            <description>desc POUT8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT9</name>
                            <description>desc POUT9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT10</name>
                            <description>desc POUT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT11</name>
                            <description>desc POUT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT12</name>
                            <description>desc POUT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT13</name>
                            <description>desc POUT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT14</name>
                            <description>desc POUT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT15</name>
                            <description>desc POUT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT16</name>
                            <description>desc POUT16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT17</name>
                            <description>desc POUT17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PODRD</name>
                    <description>desc PODRD</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3CFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT0</name>
                            <description>desc POUT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT1</name>
                            <description>desc POUT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT2</name>
                            <description>desc POUT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT3</name>
                            <description>desc POUT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT4</name>
                            <description>desc POUT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT5</name>
                            <description>desc POUT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT6</name>
                            <description>desc POUT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT7</name>
                            <description>desc POUT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT8</name>
                            <description>desc POUT8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT9</name>
                            <description>desc POUT9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT10</name>
                            <description>desc POUT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT11</name>
                            <description>desc POUT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT12</name>
                            <description>desc POUT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT13</name>
                            <description>desc POUT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT14</name>
                            <description>desc POUT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT15</name>
                            <description>desc POUT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT16</name>
                            <description>desc POUT16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT17</name>
                            <description>desc POUT17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
