pyocd/pyOCD/pyocd/debug/svd/data/HC32K116.svd
                <register>
                    <name>PCRE3</name>
                    <description>desc PCRE3</description>
                    <addressOffset>0x60C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8FF7</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUD</name>
                            <description>desc PUD</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LK</name>
                            <description>desc LK</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRE3</name>
                    <description>desc PFSRE3</description>
                    <addressOffset>0x60E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRE4</name>
                    <description>desc PCRE4</description>
                    <addressOffset>0x610</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8FF7</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUD</name>
                            <description>desc PUD</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LK</name>
                            <description>desc LK</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRE4</name>
                    <description>desc PFSRE4</description>
                    <addressOffset>0x612</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRE5</name>
                    <description>desc PCRE5</description>
                    <addressOffset>0x614</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8FF7</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUD</name>
                            <description>desc PUD</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LK</name>
                            <description>desc LK</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRE5</name>
                    <description>desc PFSRE5</description>
                    <addressOffset>0x616</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRE6</name>
                    <description>desc PCRE6</description>
                    <addressOffset>0x618</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8FF7</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUD</name>
                            <description>desc PUD</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LK</name>
                            <description>desc LK</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRE6</name>
                    <description>desc PFSRE6</description>
                    <addressOffset>0x61A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
