pyocd/pyOCD/pyocd/debug/svd/data/HC32K116.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ICGA</name>
            <description>desc ICGA</description>
            <baseAddress>0x01000A00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ICGA0A</name>
                    <description>desc ICGA0A</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>SWDTAUTS</name>
                            <description>desc SWDTAUTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTITS</name>
                            <description>desc SWDTITS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTPERI</name>
                            <description>desc SWDTPERI</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTCKS</name>
                            <description>desc SWDTCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTWDPT</name>
                            <description>desc SWDTWDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTSLPOFF</name>
                            <description>desc SWDTSLPOFF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGA0B</name>
                    <description>desc ICGA0B</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>SWDTAUTS</name>
                            <description>desc SWDTAUTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTITS</name>
                            <description>desc SWDTITS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTPERI</name>
                            <description>desc SWDTPERI</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTCKS</name>
                            <description>desc SWDTCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTWDPT</name>
                            <description>desc SWDTWDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTSLPOFF</name>
                            <description>desc SWDTSLPOFF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGA0C</name>
                    <description>desc ICGA0C</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>SWDTAUTS</name>
                            <description>desc SWDTAUTS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTITS</name>
                            <description>desc SWDTITS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTPERI</name>
                            <description>desc SWDTPERI</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTCKS</name>
                            <description>desc SWDTCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTWDPT</name>
                            <description>desc SWDTWDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTSLPOFF</name>
                            <description>desc SWDTSLPOFF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGA1A</name>
                    <description>desc ICGA1A</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFF8FF307</resetMask>
                    <fields>
                        <field>
                            <name>LVD1DFS</name>
                            <description>desc LVD1DFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1DFDIS</name>
                            <description>desc LVD1DFDIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1LVL</name>
                            <description>desc LVD1LVL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1NMIS</name>
                            <description>desc LVD1NMIS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1IRS</name>
                            <description>desc LVD1IRS</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1IRDIS</name>
                            <description>desc LVD1IRDIS</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1DIS</name>
                            <description>desc LVD1DIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HRCFREQS</name>
                            <description>desc HRCFREQS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LKUPDIS</name>
                            <description>desc LKUPDIS</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NRSTEN</name>
                            <description>desc NRSTEN</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ROE</name>
                            <description>desc ROE</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIFCLK</name>
                            <description>desc NMIFCLK</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIFEN</name>
                            <description>desc NMIFEN</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMITRG</name>
                            <description>desc NMITRG</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIEN</name>
                            <description>desc NMIEN</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIICGEN</name>
                            <description>desc NMIICGEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGA1B</name>
                    <description>desc ICGA1B</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFF8FF307</resetMask>
                    <fields>
                        <field>
                            <name>LVD1DFS</name>
                            <description>desc LVD1DFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1DFDIS</name>
                            <description>desc LVD1DFDIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1LVL</name>
                            <description>desc LVD1LVL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1NMIS</name>
                            <description>desc LVD1NMIS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1IRS</name>
                            <description>desc LVD1IRS</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1IRDIS</name>
                            <description>desc LVD1IRDIS</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LVD1DIS</name>
                            <description>desc LVD1DIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HRCFREQS</name>
                            <description>desc HRCFREQS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LKUPDIS</name>
                            <description>desc LKUPDIS</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NRSTEN</name>
                            <description>desc NRSTEN</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ROE</name>
                            <description>desc ROE</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIFCLK</name>
                            <description>desc NMIFCLK</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIFEN</name>
                            <description>desc NMIFEN</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMITRG</name>
                            <description>desc NMITRG</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIEN</name>
                            <description>desc NMIEN</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NMIICGEN</name>
                            <description>desc NMIICGEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
