pyocd/pyOCD/pyocd/debug/svd/data/HC32K116.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ICGB</name>
            <description>desc ICGB</description>
            <baseAddress>0x40017800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ICGB0LLA</name>
                    <description>desc ICGB0LLA</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT0</name>
                            <description>desc FNWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT1</name>
                            <description>desc FNWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT2</name>
                            <description>desc FNWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT3</name>
                            <description>desc FNWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT4</name>
                            <description>desc FNWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT5</name>
                            <description>desc FNWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT6</name>
                            <description>desc FNWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT7</name>
                            <description>desc FNWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0LLB</name>
                    <description>desc ICGB0LLB</description>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT0</name>
                            <description>desc FNWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT1</name>
                            <description>desc FNWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT2</name>
                            <description>desc FNWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT3</name>
                            <description>desc FNWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT4</name>
                            <description>desc FNWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT5</name>
                            <description>desc FNWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT6</name>
                            <description>desc FNWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT7</name>
                            <description>desc FNWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0LLC</name>
                    <description>desc ICGB0LLC</description>
                    <addressOffset>0x2</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT0</name>
                            <description>desc FNWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT1</name>
                            <description>desc FNWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT2</name>
                            <description>desc FNWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT3</name>
                            <description>desc FNWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT4</name>
                            <description>desc FNWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT5</name>
                            <description>desc FNWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT6</name>
                            <description>desc FNWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT7</name>
                            <description>desc FNWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0LHA</name>
                    <description>desc ICGB0LHA</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT8</name>
                            <description>desc FNWPRT8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT9</name>
                            <description>desc FNWPRT9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT10</name>
                            <description>desc FNWPRT10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT11</name>
                            <description>desc FNWPRT11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT12</name>
                            <description>desc FNWPRT12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT13</name>
                            <description>desc FNWPRT13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT14</name>
                            <description>desc FNWPRT14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT15</name>
                            <description>desc FNWPRT15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0LHB</name>
                    <description>desc ICGB0LHB</description>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT8</name>
                            <description>desc FNWPRT8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT9</name>
                            <description>desc FNWPRT9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT10</name>
                            <description>desc FNWPRT10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT11</name>
                            <description>desc FNWPRT11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT12</name>
                            <description>desc FNWPRT12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT13</name>
                            <description>desc FNWPRT13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT14</name>
                            <description>desc FNWPRT14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT15</name>
                            <description>desc FNWPRT15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0LHC</name>
                    <description>desc ICGB0LHC</description>
                    <addressOffset>0x6</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT8</name>
                            <description>desc FNWPRT8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT9</name>
                            <description>desc FNWPRT9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT10</name>
                            <description>desc FNWPRT10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT11</name>
                            <description>desc FNWPRT11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT12</name>
                            <description>desc FNWPRT12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT13</name>
                            <description>desc FNWPRT13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT14</name>
                            <description>desc FNWPRT14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT15</name>
                            <description>desc FNWPRT15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0HLA</name>
                    <description>desc ICGB0HLA</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT16</name>
                            <description>desc FNWPRT16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT17</name>
                            <description>desc FNWPRT17</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT18</name>
                            <description>desc FNWPRT18</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT19</name>
                            <description>desc FNWPRT19</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT20</name>
                            <description>desc FNWPRT20</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT21</name>
                            <description>desc FNWPRT21</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT22</name>
                            <description>desc FNWPRT22</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT23</name>
                            <description>desc FNWPRT23</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
