pyocd/pyOCD/pyocd/debug/svd/data/HC32K116.svd
                <register>
                    <name>ICGB0HLB</name>
                    <description>desc ICGB0HLB</description>
                    <addressOffset>0x9</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT16</name>
                            <description>desc FNWPRT16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT17</name>
                            <description>desc FNWPRT17</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT18</name>
                            <description>desc FNWPRT18</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT19</name>
                            <description>desc FNWPRT19</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT20</name>
                            <description>desc FNWPRT20</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT21</name>
                            <description>desc FNWPRT21</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT22</name>
                            <description>desc FNWPRT22</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT23</name>
                            <description>desc FNWPRT23</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0HLC</name>
                    <description>desc ICGB0HLC</description>
                    <addressOffset>0xA</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT16</name>
                            <description>desc FNWPRT16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT17</name>
                            <description>desc FNWPRT17</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT18</name>
                            <description>desc FNWPRT18</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT19</name>
                            <description>desc FNWPRT19</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT20</name>
                            <description>desc FNWPRT20</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT21</name>
                            <description>desc FNWPRT21</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT22</name>
                            <description>desc FNWPRT22</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT23</name>
                            <description>desc FNWPRT23</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0HHA</name>
                    <description>desc ICGB0HHA</description>
                    <addressOffset>0xC</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT24</name>
                            <description>desc FNWPRT24</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT25</name>
                            <description>desc FNWPRT25</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT26</name>
                            <description>desc FNWPRT26</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT27</name>
                            <description>desc FNWPRT27</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT28</name>
                            <description>desc FNWPRT28</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT29</name>
                            <description>desc FNWPRT29</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT30</name>
                            <description>desc FNWPRT30</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT31</name>
                            <description>desc FNWPRT31</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0HHB</name>
                    <description>desc ICGB0HHB</description>
                    <addressOffset>0xD</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT24</name>
                            <description>desc FNWPRT24</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT25</name>
                            <description>desc FNWPRT25</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT26</name>
                            <description>desc FNWPRT26</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT27</name>
                            <description>desc FNWPRT27</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT28</name>
                            <description>desc FNWPRT28</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT29</name>
                            <description>desc FNWPRT29</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT30</name>
                            <description>desc FNWPRT30</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT31</name>
                            <description>desc FNWPRT31</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB0HHC</name>
                    <description>desc ICGB0HHC</description>
                    <addressOffset>0xE</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FNWPRT24</name>
                            <description>desc FNWPRT24</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT25</name>
                            <description>desc FNWPRT25</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT26</name>
                            <description>desc FNWPRT26</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT27</name>
                            <description>desc FNWPRT27</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT28</name>
                            <description>desc FNWPRT28</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT29</name>
                            <description>desc FNWPRT29</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT30</name>
                            <description>desc FNWPRT30</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FNWPRT31</name>
                            <description>desc FNWPRT31</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1LLA</name>
                    <description>desc ICGB1LLA</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT0</name>
                            <description>desc ENWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT1</name>
                            <description>desc ENWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT2</name>
                            <description>desc ENWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT3</name>
                            <description>desc ENWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT4</name>
                            <description>desc ENWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT5</name>
                            <description>desc ENWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT6</name>
                            <description>desc ENWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT7</name>
                            <description>desc ENWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1LLB</name>
                    <description>desc ICGB1LLB</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT0</name>
                            <description>desc ENWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT1</name>
                            <description>desc ENWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT2</name>
                            <description>desc ENWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT3</name>
                            <description>desc ENWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT4</name>
                            <description>desc ENWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT5</name>
                            <description>desc ENWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT6</name>
                            <description>desc ENWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT7</name>
                            <description>desc ENWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
