pyocd/pyOCD/pyocd/debug/svd/data/HC32K116.svd
                <register>
                    <name>ICGB1LLC</name>
                    <description>desc ICGB1LLC</description>
                    <addressOffset>0x12</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT0</name>
                            <description>desc ENWPRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT1</name>
                            <description>desc ENWPRT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT2</name>
                            <description>desc ENWPRT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT3</name>
                            <description>desc ENWPRT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT4</name>
                            <description>desc ENWPRT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT5</name>
                            <description>desc ENWPRT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT6</name>
                            <description>desc ENWPRT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT7</name>
                            <description>desc ENWPRT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1LHA</name>
                    <description>desc ICGB1LHA</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT8</name>
                            <description>desc ENWPRT8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT9</name>
                            <description>desc ENWPRT9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT10</name>
                            <description>desc ENWPRT10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT11</name>
                            <description>desc ENWPRT11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT12</name>
                            <description>desc ENWPRT12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT13</name>
                            <description>desc ENWPRT13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT14</name>
                            <description>desc ENWPRT14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT15</name>
                            <description>desc ENWPRT15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1LHB</name>
                    <description>desc ICGB1LHB</description>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT8</name>
                            <description>desc ENWPRT8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT9</name>
                            <description>desc ENWPRT9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT10</name>
                            <description>desc ENWPRT10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT11</name>
                            <description>desc ENWPRT11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT12</name>
                            <description>desc ENWPRT12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT13</name>
                            <description>desc ENWPRT13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT14</name>
                            <description>desc ENWPRT14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT15</name>
                            <description>desc ENWPRT15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1LHC</name>
                    <description>desc ICGB1LHC</description>
                    <addressOffset>0x16</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT8</name>
                            <description>desc ENWPRT8</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT9</name>
                            <description>desc ENWPRT9</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT10</name>
                            <description>desc ENWPRT10</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT11</name>
                            <description>desc ENWPRT11</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT12</name>
                            <description>desc ENWPRT12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT13</name>
                            <description>desc ENWPRT13</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT14</name>
                            <description>desc ENWPRT14</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT15</name>
                            <description>desc ENWPRT15</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1HLA</name>
                    <description>desc ICGB1HLA</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT16</name>
                            <description>desc ENWPRT16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT17</name>
                            <description>desc ENWPRT17</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT18</name>
                            <description>desc ENWPRT18</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT19</name>
                            <description>desc ENWPRT19</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT20</name>
                            <description>desc ENWPRT20</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT21</name>
                            <description>desc ENWPRT21</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT22</name>
                            <description>desc ENWPRT22</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT23</name>
                            <description>desc ENWPRT23</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1HLB</name>
                    <description>desc ICGB1HLB</description>
                    <addressOffset>0x19</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT16</name>
                            <description>desc ENWPRT16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT17</name>
                            <description>desc ENWPRT17</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT18</name>
                            <description>desc ENWPRT18</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT19</name>
                            <description>desc ENWPRT19</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT20</name>
                            <description>desc ENWPRT20</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT21</name>
                            <description>desc ENWPRT21</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT22</name>
                            <description>desc ENWPRT22</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT23</name>
                            <description>desc ENWPRT23</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICGB1HLC</name>
                    <description>desc ICGB1HLC</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ENWPRT16</name>
                            <description>desc ENWPRT16</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT17</name>
                            <description>desc ENWPRT17</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT18</name>
                            <description>desc ENWPRT18</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT19</name>
                            <description>desc ENWPRT19</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT20</name>
                            <description>desc ENWPRT20</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT21</name>
                            <description>desc ENWPRT21</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT22</name>
                            <description>desc ENWPRT22</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENWPRT23</name>
                            <description>desc ENWPRT23</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
